[
    {
    "fact": "Exoplanets are planets that orbit stars outside our solar system. The first confirmed discovery of an exoplanet was made in 1992, orbiting a pulsar named PSR B1257+12, making them some of the oldest known planetary systems."
    },
    {
    "fact": "The smallest exoplanet discovered so far is smaller than Earth's moon, while the largest ones, known as 'super-Jupiters,' are several times the size of Jupiter. This highlights the incredible diversity of planetary sizes in the universe."
    },
    {
    "fact": "Some exoplanets are so close to their stars that they complete an orbit in just a few hours. These planets, called 'hot Jupiters,' have scorching surface temperatures reaching thousands of degrees Celsius."
    },
    {
    "fact": "The Kepler Space Telescope, launched in 2009, revolutionized our understanding of exoplanets, discovering over 2,600 confirmed planets during its mission and revealing that planets are common in the universe."
    },
    {
    "fact": "One of the strangest exoplanets discovered is HD 189733b, which has winds blowing at speeds of up to 8,700 km/h and rains molten glass sideways due to its scorching atmosphere."
    },
    {
    "fact": "Some exoplanets, like Kepler-22b, are located in the 'habitable zone' of their stars, where conditions might allow liquid water to exist. These planets are prime candidates in the search for extraterrestrial life."
    },
    {
    "fact": "Trappist-1 is a star system with seven Earth-sized exoplanets. Three of these planets are in the habitable zone, making it one of the most exciting discoveries in the search for life beyond Earth."
    },
    {
    "fact": "55 Cancri e is a super-Earth exoplanet that might be composed largely of diamond. Its high carbon content and intense pressure make it one of the universe's most dazzling worlds."
    },
    {
    "fact": "Rogue planets are exoplanets that wander through space without orbiting any star. These mysterious worlds drift in the darkness, possibly forming in stellar systems before being ejected."
    },
    {
    "fact": "Scientists use methods like the transit method and radial velocity to detect exoplanets. These techniques allow them to study tiny wobbles or dimming of a star's light caused by orbiting planets."
    }
]
  